        L"c:",
        L"/",
        L"フウ",
        L"ばあ",
        L"馬鈴",
        L"テスト.テXト",
        L"テXト",
        L".テXト",
        L"瓶",
        L"テスト",

        L"c:/",

        L"フウ/テスト.テXト",
        L"フウ/ばあ/馬鈴/テスト.テXト",
        L"/フウ/ばあ/馬鈴/テスト.テXト",
        L"c:/フウ/ばあ/馬鈴/テスト.テXト",
        L"c:フウ/ばあ/馬鈴/テスト.テXト",
        L"c:/フウ/ばあ/馬鈴/テスト.瓶",
        L"c:/フウ/ばあ/馬鈴/テスト.テスト",

        L"c:/フウ/ばあ/馬鈴/.テスト",
        L"c:/フウ/ばあ/馬鈴/.テスト.テXト",
        L"c:/フウ/ばあ/馬鈴/.テスト.テスト",

        L"c:////フウ/./././//ばあ/../ばあ/馬鈴/テスト.テXト",
        L"/.///./フウ/../.フウ/テスト.テXト/../.テスト.テXト",

        // L"フウ/テスト",
        // L"フウ/ばあ/馬鈴/テスト",
        // L"/フウ/ばあ/馬鈴/テスト",
        // L"c:フウ/ばあ/馬鈴/テスト",
        L"c:/フウ/ばあ/馬鈴/テスト",

        //L"フウ/ばあ/馬鈴",
        //L"/フウ/ばあ/馬鈴",
        //L"c:フウ/ばあ/馬鈴",

        L"c:/フウ/ばあ/馬鈴",
        L"c:/フウ/ばあ/馬鈴/",

        L"d:",

        L".フウ",
        L".テスト",
        L".フウ/.テスト",
        //L".テスト.テXト",
        //L".フウ/.テスト.テXト",
        L"/.フウ/.テスト.テXト",
        L"c:/.フウ/.テスト.テXト",

        //L"フウ/////テスト.テXト",
        //L"フウ//ばあ/././馬鈴/../../テスト.テXト",

        L"",
